Revit.Elements.ScheduleOnSheet.InternalScheduleOnSheet
An internal reference to the ScheduleSheetInstance

Revit.Elements.ScheduleOnSheet.InternalElement
Reference to the Element

Revit.Elements.ScheduleOnSheet.#ctor(Autodesk.Revit.DB.ScheduleSheetInstance)
Private constructor for the Element
ScheduleOnSheet:

Revit.Elements.ScheduleOnSheet.#ctor(Revit.Elements.Views.Sheet,Revit.Elements.Views.ScheduleView,Autodesk.DesignScript.Geometry.Point)
Create a new ScheduleOnSheet by sheet, scheduleView and location
sheet:
scheduleView:
location:

Revit.Elements.ScheduleOnSheet.InitScheduleOnSheet(Autodesk.Revit.DB.ScheduleSheetInstance)
Initialize a ScheduleOnSheet element
ScheduleOnSheet:

Revit.Elements.ScheduleOnSheet.InitScheduleOnSheet(Revit.Elements.Views.Sheet,Revit.Elements.Views.ScheduleView,Autodesk.DesignScript.Geometry.Point)
Initialize a ScheduleOnSheet element
sheet:
scheduleView:
location:

Revit.Elements.ScheduleOnSheet.InternalSetScheduleOnSheet(Autodesk.Revit.DB.ScheduleSheetInstance)
Set the ScheduleOnSheet property, element id, and unique id
ScheduleOnSheet:

Revit.Elements.ScheduleOnSheet.Location
Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).

Revit.Elements.ScheduleOnSheet.SetLocation(Autodesk.DesignScript.Geometry.Point)
Set the Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
point:
Returns:

Revit.Elements.ScheduleOnSheet.Sheet
Get ViewSheet on which the ScheduleView appears

Revit.Elements.ScheduleOnSheet.ScheduleView
The schedule that generates this ScheduleInstance.

Revit.Elements.ScheduleOnSheet.BySheetScheduleLocation(Revit.Elements.Views.Sheet,Revit.Elements.Views.ScheduleView,Autodesk.DesignScript.Geometry.Point)
Creates a new ScheduleOnSheet at a given location on a sheet.
sheet: The Sheet on which the new ScheduleOnSheet will be placed.
scheduleView: The scheduleView shown in the ScheduleOnSheet.
location: The new ScheduleOnSheet will be centered on this point.
Returns: The new ScheduleOnSheet

Revit.Elements.ScheduleOnSheet.FromExisting(Autodesk.Revit.DB.ScheduleSheetInstance,System.Boolean)
Create a ScheduleOnSheet from a user selected Element.
ScheduleOnSheet:
isRevitOwned:
Returns: